       IDENTIFICATION DIVISION.
       PROGRAM-ID.   sendgrid.
       AUTHOR.       Robin Johnson. Alex Reed.

       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
      * SendGrid Authentication
           01 SG-AUTH-USERNAME    PIC X(100) VALUE SPACES.
           01 SG-AUTH-PASSWORD    PIC X(50)  VALUE SPACES.

       DATA DIVISION.
       WORKING-STORAGE SECTION.


       PROCEDURE DIVISION.
       		ACCEPT SG-AUTH-USERNAME FROM ENVIRONMENT "SENDGRID_USERNAME".
          ACCEPT SG-AUTH-PASSWORD FROM ENVIRONMENT "SENDGRID_PASSWORD".



      *LET'S GET THIS DONE !!
       		DISPLAY "THIS IS GETTING DONE, YO."

       END PROGRAM
